src/main/java/ok/dht/test/slastin/report/wrk2/get-26000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 2193.134ms, rate sampling interval: 8617ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.69s     5.68s   24.31s    57.63%
    Req/Sec    11.59k   164.09    11.85k    75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.75s 
 75.000%   19.64s 
 90.000%   22.53s 
 99.000%   24.15s 
 99.900%   24.31s 
 99.990%   24.33s 
 99.999%   24.33s 
100.000%   24.33s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4943.871     0.000000           38         1.00
    6713.343     0.100000        40580         1.11
    8790.015     0.200000        81163         1.25
   10747.903     0.300000       121810         1.43
   12632.063     0.400000       162503         1.67
   14745.599     0.500000       203060         2.00
   15728.639     0.550000       223276         2.22
   16826.367     0.600000       243564         2.50
   17809.407     0.650000       263905         2.86
   18759.679     0.700000       284053         3.33
   19644.415     0.750000       304402         4.00
   20135.935     0.775000       314532         4.44
   20627.455     0.800000       324664         5.00
   21118.975     0.825000       334845         5.71
   21544.959     0.850000       344961         6.67
   22036.479     0.875000       355304         8.00
   22282.239     0.887500       360180         8.89
   22527.999     0.900000       365314        10.00
   22740.991     0.912500       370328        11.43
   22953.983     0.925000       375460        13.33
   23199.743     0.937500       380673        16.00
   23298.047     0.943750       383095        17.78
   23396.351     0.950000       385487        20.00
   23511.039     0.956250       388303        22.86
   23609.343     0.962500       390744        26.67
   23724.031     0.968750       393322        32.00
   23789.567     0.971875       394592        35.56
   23855.103     0.975000       395720        40.00
   23920.639     0.978125       396962        45.71
   23986.175     0.981250       398253        53.33
   24051.711     0.984375       399806        64.00
   24068.095     0.985938       400211        71.11
   24100.863     0.987500       400968        80.00
   24133.631     0.989062       401586        91.43
   24166.399     0.990625       402255       106.67
   24199.167     0.992188       402990       128.00
   24199.167     0.992969       402990       142.22
   24215.551     0.993750       403410       160.00
   24231.935     0.994531       403821       182.86
   24248.319     0.995313       404104       213.33
   24264.703     0.996094       404398       256.00
   24264.703     0.996484       404398       284.44
   24281.087     0.996875       404691       320.00
   24281.087     0.997266       404691       365.71
   24297.471     0.997656       405019       426.67
   24297.471     0.998047       405019       512.00
   24313.855     0.998242       405406       568.89
   24313.855     0.998437       405406       640.00
   24313.855     0.998633       405406       731.43
   24313.855     0.998828       405406       853.33
   24313.855     0.999023       405406      1024.00
   24330.239     0.999121       405775      1137.78
   24330.239     1.000000       405775          inf
#[Mean    =    14692.534, StdDeviation   =     5677.036]
#[Max     =    24313.856, Total count    =       405775]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  537424 requests in 45.00s, 599.91MB read
Requests/sec:  11942.89
Transfer/sec:     13.33MB