src/main/java/ok/dht/test/slastin/report/wrk2/get-27500.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 2426.020ms, rate sampling interval: 9478ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.62s     5.98s   26.15s    57.04%
    Req/Sec    11.20k   118.72    11.31k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.62s 
 75.000%   20.79s 
 90.000%   24.02s 
 99.000%   25.94s 
 99.900%   26.15s 
 99.990%   26.17s 
 99.999%   26.17s 
100.000%   26.17s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5353.471     0.000000           22         1.00
    7434.239     0.100000        39030         1.11
    9297.919     0.200000        78152         1.25
   11501.567     0.300000       117102         1.43
   13508.607     0.400000       156146         1.67
   15622.143     0.500000       195160         2.00
   16572.415     0.550000       214614         2.22
   17498.111     0.600000       234417         2.50
   18513.919     0.650000       253861         2.86
   19660.799     0.700000       273297         3.33
   20791.295     0.750000       292839         4.00
   21348.351     0.775000       302483         4.44
   21905.407     0.800000       312198         5.00
   22413.311     0.825000       321995         5.71
   22953.983     0.850000       331661         6.67
   23494.655     0.875000       341454         8.00
   23756.799     0.887500       346389         8.89
   24018.943     0.900000       351424        10.00
   24248.319     0.912500       356090        11.43
   24510.463     0.925000       360974        13.33
   24772.607     0.937500       365824        16.00
   24920.063     0.943750       368447        17.78
   25051.135     0.950000       370887        20.00
   25198.591     0.956250       373246        22.86
   25313.279     0.962500       375559        26.67
   25444.351     0.968750       378190        32.00
   25509.887     0.971875       379262        35.56
   25591.807     0.975000       380654        40.00
   25640.959     0.978125       381717        45.71
   25706.495     0.981250       383132        53.33
   25772.031     0.984375       384195        64.00
   25821.183     0.985938       384737        71.11
   25886.719     0.987500       385574        80.00
   25919.487     0.989062       386149        91.43
   25952.255     0.990625       386725       106.67
   25985.023     0.992188       387162       128.00
   26001.407     0.992969       387444       142.22
   26034.175     0.993750       388030       160.00
   26050.559     0.994531       388312       182.86
   26066.943     0.995313       388686       213.33
   26066.943     0.996094       388686       256.00
   26083.327     0.996484       388966       284.44
   26083.327     0.996875       388966       320.00
   26099.711     0.997266       389228       365.71
   26116.095     0.997656       389498       426.67
   26116.095     0.998047       389498       512.00
   26116.095     0.998242       389498       568.89
   26132.479     0.998437       389754       640.00
   26132.479     0.998633       389754       731.43
   26132.479     0.998828       389754       853.33
   26148.863     0.999023       390014      1024.00
   26148.863     0.999121       390014      1137.78
   26148.863     0.999219       390014      1280.00
   26148.863     0.999316       390014      1462.86
   26148.863     0.999414       390014      1706.67
   26148.863     0.999512       390014      2048.00
   26148.863     0.999561       390014      2275.56
   26165.247     0.999609       390174      2560.00
   26165.247     1.000000       390174          inf
#[Mean    =    15616.705, StdDeviation   =     5983.524]
#[Max     =    26148.864, Total count    =       390174]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  518126 requests in 45.00s, 598.42MB read
Requests/sec:  11513.93
Transfer/sec:     13.30MB