src/main/java/ok/dht/test/slastin/report/wrk2/get-30000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 2600.578ms, rate sampling interval: 10108ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.30s     6.06s   26.97s    57.11%
    Req/Sec    11.83k   301.77    12.25k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.14s 
 75.000%   21.51s 
 90.000%   24.74s 
 99.000%   26.77s 
 99.900%   26.97s 
 99.990%   26.98s 
 99.999%   26.98s 
100.000%   26.98s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5746.687     0.000000           29         1.00
    8093.695     0.100000        41341         1.11
    9986.047     0.200000        82633         1.25
   12230.655     0.300000       123889         1.43
   14172.159     0.400000       165115         1.67
   16138.239     0.500000       206363         2.00
   17219.583     0.550000       227260         2.22
   18251.775     0.600000       247907         2.50
   19349.503     0.650000       268278         2.86
   20365.311     0.700000       289190         3.33
   21512.191     0.750000       309814         4.00
   22151.167     0.775000       319849         4.44
   22724.607     0.800000       330278         5.00
   23248.895     0.825000       340488         5.71
   23756.799     0.850000       351009         6.67
   24248.319     0.875000       361405         8.00
   24477.695     0.887500       366407         8.89
   24739.839     0.900000       371589        10.00
   25001.983     0.912500       376825        11.43
   25280.511     0.925000       382053        13.33
   25591.807     0.937500       387046        16.00
   25722.879     0.943750       389646        17.78
   25853.951     0.950000       392246        20.00
   26001.407     0.956250       394753        22.86
   26148.863     0.962500       397362        26.67
   26296.319     0.968750       399924        32.00
   26361.855     0.971875       401135        35.56
   26427.391     0.975000       402403        40.00
   26492.927     0.978125       403811        45.71
   26558.463     0.981250       405041        53.33
   26623.999     0.984375       406256        64.00
   26673.151     0.985938       407056        71.11
   26705.919     0.987500       407584        80.00
   26755.071     0.989062       408385        91.43
   26787.839     0.990625       408910       106.67
   26836.991     0.992188       409800       128.00
   26836.991     0.992969       409800       142.22
   26853.375     0.993750       410155       160.00
   26869.759     0.994531       410522       182.86
   26886.143     0.995313       410811       213.33
   26918.911     0.996094       411342       256.00
   26918.911     0.996484       411342       284.44
   26935.295     0.996875       411681       320.00
   26935.295     0.997266       411681       365.71
   26951.679     0.997656       412043       426.67
   26951.679     0.998047       412043       512.00
   26951.679     0.998242       412043       568.89
   26968.063     0.998437       412401       640.00
   26968.063     0.998633       412401       731.43
   26968.063     0.998828       412401       853.33
   26968.063     0.999023       412401      1024.00
   26968.063     0.999121       412401      1137.78
   26968.063     0.999219       412401      1280.00
   26984.447     0.999316       412700      1462.86
   26984.447     1.000000       412700          inf
#[Mean    =    16298.736, StdDeviation   =     6060.823]
#[Max     =    26968.064, Total count    =       412700]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  540515 requests in 45.00s, 600.15MB read
Requests/sec:  12011.59
Transfer/sec:     13.34MB